// 3. Объявить две целочисленные переменные a и b и задать им произвольные начальные значения.
// Затем написать скрипт, который работает по следующему принципу:
// если a и b положительные, вывести их разность;
// если а и b отрицательные, вывести их произведение;
// если а и b разных знаков, вывести их сумму; ноль можно считать положительным числом.

let a = parseInt(prompt('a = ')), b = parseInt(prompt('b = '));
// let a = 6, b = -1;
if (a >= 0 && b >= 0) alert('result ' + (a-b));
else if (a < 0 && b < 0) alert('result ' + (a*b));
else alert('result ' + (a+b));


// 4. Присвоить переменной c значение в промежутке [0..15].
// С помощью оператора switch организовать вывод чисел от c до 15.

let c = parseInt(prompt('enter number (0-15)'));
switch (c){
    case 0:
        alert('0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15');
        break;
    case 1:
        alert('1,2,3,4,5,6,7,8,9,10,11,12,13,14,15');
        break;
    case 2:
        alert('2,3,4,5,6,7,8,9,10,11,12,13,14,15');
        break;
    case 3:
        alert('3,4,5,6,7,8,9,10,11,12,13,14,15');
        break;
    case 4:
        alert('4,5,6,7,8,9,10,11,12,13,14,15');
        break;
    case 5:
        alert('5,6,7,8,9,10,11,12,13,14,15');
        break;
    case 6:
        alert('6,7,8,9,10,11,12,13,14,15');
        break;
    case 7:
        alert('7,8,9,10,11,12,13,14,15');
        break;
    case 8:
        alert('8,9,10,11,12,13,14,15');
        break;
    case 9:
        alert('9,10,11,12,13,14,15');
        break;
    case 10:
        alert('10,11,12,13,14,15');
        break;
    case 11:
        alert('11,12,13,14,15');
        break;
    case 12:
        alert('12,13,14,15');
        break;
    case 13:
        alert('13,14,15');
        break;
    case 14:
        alert('14,15');
        break;
    case 15:
        alert('15');
        break;
    default:
        alert('wrong input')
        
}


